ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l111x/GPIOA_1.0.xml
        <register id="GPIOA_CPU_INT_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DIO0" description="DIO0 event" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO0 in RIS register"/>
            </bitfield>
            <bitfield id="DIO1" description="DIO1 event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO1 in RIS register"/>
            </bitfield>
            <bitfield id="DIO2" description="DIO2 event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO2 in RIS register"/>
            </bitfield>
            <bitfield id="DIO3" description="DIO3 event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO3 in RIS register"/>
            </bitfield>
            <bitfield id="DIO4" description="DIO4 event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO4 in RIS register"/>
            </bitfield>
            <bitfield id="DIO5" description="DIO5 event" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO5 in RIS register"/>
            </bitfield>
            <bitfield id="DIO6" description="DIO6 event" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO6 in RIS register"/>
            </bitfield>
            <bitfield id="DIO7" description="DIO7 event" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO7 in RIS register"/>
            </bitfield>
            <bitfield id="DIO8" description="DIO8 event" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO8 in RIS register"/>
            </bitfield>
            <bitfield id="DIO9" description="DIO9 event" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO9 in RIS register"/>
            </bitfield>
            <bitfield id="DIO10" description="DIO10 event" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO10 in RIS register"/>
            </bitfield>
            <bitfield id="DIO11" description="DIO11 event" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO11 in RIS register"/>
            </bitfield>
            <bitfield id="DIO12" description="DIO12 event" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO12 in RIS register"/>
            </bitfield>
            <bitfield id="DIO13" description="DIO13 event" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO13 in RIS register"/>
            </bitfield>
            <bitfield id="DIO14" description="DIO14 event" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO14 in RIS register"/>
            </bitfield>
            <bitfield id="DIO15" description="DIO15 event" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO15 in RIS register"/>
            </bitfield>
            <bitfield id="DIO16" description="DIO16 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO16 in RIS register"/>
            </bitfield>
            <bitfield id="DIO17" description="DIO17 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO17 in RIS register"/>
            </bitfield>
            <bitfield id="DIO18" description="DIO18 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO18 in RIS register"/>
            </bitfield>
            <bitfield id="DIO19" description="DIO19 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO19 in RIS register"/>
            </bitfield>
            <bitfield id="DIO20" description="DIO20 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO20 in RIS register"/>
            </bitfield>
            <bitfield id="DIO21" description="DIO21 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO21 in RIS register"/>
            </bitfield>
            <bitfield id="DIO22" description="DIO22 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO22 in RIS register"/>
            </bitfield>
            <bitfield id="DIO23" description="DIO23 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO23 in RIS register"/>
            </bitfield>
            <bitfield id="DIO24" description="DIO24 event" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO24 in RIS register"/>
            </bitfield>
            <bitfield id="DIO25" description="DIO25 event" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO25 in RIS register"/>
            </bitfield>
            <bitfield id="DIO26" description="DIO26 event" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO26 in RIS register"/>
            </bitfield>
            <bitfield id="DIO27" description="DIO27 event" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO27 in RIS register"/>
            </bitfield>
            <bitfield id="DIO28" description="DIO28 event" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO28 in RIS register"/>
            </bitfield>
            <bitfield id="DIO29" description="DIO29 event" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO29 in RIS register"/>
            </bitfield>
            <bitfield id="DIO30" description="DIO30 event" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO30 in RIS register"/>
            </bitfield>
            <bitfield id="DIO31" description="DIO31 event" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO31 in RIS register"/>
            </bitfield>
        </register>
