ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l111x/GPIOA_1.0.xml
    <register id="GPIOA_SUB0CFG" width="32" offset="0x1500" description="Subscriber 0 configuration">
        <bitfield id="ENABLE" description="This bit is used to enable subscriber 0 event." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="Subscriber 0 event is disabled"/>
            <bitenum id="SET" value="0x1" description="Subscriber 0 event is enabled"/>
        </bitfield>
        <bitfield id="OUTPOLICY" description="These bits configure the output policy for subscriber 0 event." begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="SET" value="0x0" description="Selected DIO pins are set"/>
            <bitenum id="CLR" value="0x1" description="Selected DIO pins are cleared"/>
            <bitenum id="TOGGLE" value="0x2" description="Selected DIO pins are toggled"/>
        </bitfield>
        <bitfield id="INDEX" description="Indicates the specific bit among lower 16 bits that is targeted by the subscriber action" begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MIN" value="0x0" description="specific bit targeted by the subscriber action is bit0"/>
            <bitenum id="MAX" value="0xF" description="specific bit targeted by the subscriber action is bit15"/>
        </bitfield>
    </register>
    <register id="GPIOA_FILTEREN15_0" width="32" offset="0x1508" description="Filter Enable 15 to 0">
        <bitfield id="DIN0" description="Programmable counter length of digital glitch filter for DIN0" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN1" description="Programmable counter length of digital glitch filter for DIN1" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN2" description="Programmable counter length of digital glitch filter for DIN2" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN3" description="Programmable counter length of digital glitch filter for DIN3" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN4" description="Programmable counter length of digital glitch filter for DIN4" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN5" description="Programmable counter length of digital glitch filter for DIN5" begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN6" description="Programmable counter length of digital glitch filter for DIN6" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN7" description="Programmable counter length of digital glitch filter for DIN7" begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN8" description="Programmable counter length of digital glitch filter for DIN8" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN9" description="Programmable counter length of digital glitch filter for DIN9" begin="19" end="18" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN10" description="Programmable counter length of digital glitch filter for DIN10" begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN11" description="Programmable counter length of digital glitch filter for DIN11" begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN12" description="Programmable counter length of digital glitch filter for DIN12" begin="25" end="24" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN13" description="Programmable counter length of digital glitch filter for DIN13" begin="27" end="26" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN14" description="Programmable counter length of digital glitch filter for DIN14" begin="29" end="28" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN15" description="Programmable counter length of digital glitch filter for DIN15" begin="31" end="30" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
    </register>
    <register id="GPIOA_FILTEREN31_16" width="32" offset="0x150C" description="Filter Enable 31 to 16">
        <bitfield id="DIN16" description="Programmable counter length of digital glitch filter for DIN16" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN17" description="Programmable counter length of digital glitch filter for DIN17" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN18" description="Programmable counter length of digital glitch filter for DIN18" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN19" description="Programmable counter length of digital glitch filter for DIN19" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN20" description="Programmable counter length of digital glitch filter for DIN20" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN21" description="Programmable counter length of digital glitch filter for DIN21" begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN22" description="Programmable counter length of digital glitch filter for DIN22" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN23" description="Programmable counter length of digital glitch filter for DIN23" begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN24" description="Programmable counter length of digital glitch filter for DIN24" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN25" description="Programmable counter length of digital glitch filter for DIN25" begin="19" end="18" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN26" description="Programmable counter length of digital glitch filter for DIN26" begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN27" description="Programmable counter length of digital glitch filter for DIN27" begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN28" description="Programmable counter length of digital glitch filter for DIN28" begin="25" end="24" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN29" description="Programmable counter length of digital glitch filter for DIN29" begin="27" end="26" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN30" description="Programmable counter length of digital glitch filter for DIN30" begin="29" end="28" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
        <bitfield id="DIN31" description="Programmable counter length of digital glitch filter for DIN31" begin="31" end="30" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No additional filter beyond the CDC synchronization sample"/>
            <bitenum id="ONE_CYCLE" value="0x1" description="1 ULPCLK minimum sample"/>
            <bitenum id="THREE_CYCLE" value="0x2" description="3 ULPCLK minimum sample"/>
            <bitenum id="EIGHT_CYCLE" value="0x3" description="8 ULPCLK minimum sample"/>
        </bitfield>
    </register>
